[Killed] LogicalOperator
main/pages/Courses/PSCourseCreatePage.js:46:7
   if (mutation.isError) {
     console.log(mutation.error.response.data);
     if (
-      mutation.error.response.status === 400 ||
-      mutation.error.response.data?.message.includes("PersonalSchedule with id")
+      mutation.error.response.status === 400 && mutation.error.response.data?.message.includes("PersonalSchedule with id")
     ) {
       return (
killedBy: CoursesCreatePage tests 404
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Error: Personal schedule not found. Please create a new personal schedule first.
Received:
  Error: PersonalSchedule with id 3000 not found

<html>

[Killed] EqualityOperator
main/pages/Courses/PSCourseCreatePage.js:46:7
   if (mutation.isError) {
     console.log(mutation.error.response.data);
     if (
-      mutation.error.response.status === 400 ||
+      mutation.error.response.status !== 400 ||
       mutation.error.response.data?.message.includes("PersonalSchedule with id")
     ) {
killedBy: CoursesCreatePage tests 400
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Error: Personal schedule not found. Please create a new personal schedule first.
Received:
  Error:

<html>

[Killed] OptionalChaining
main/pages/Courses/PSCourseCreatePage.js:47:7
     console.log(mutation.error.response.data);
     if (
       mutation.error.response.status === 400 ||
-      mutation.error.response.data?.message.includes("PersonalSchedule with id")
+      mutation.error.response.data.message.includes("PersonalSchedule with id")
     ) {
       return (
killedBy: CoursesCreatePage tests when you input incorrect information, we get an error
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:48:7
     if (
       mutation.error.response.status === 400 ||
       mutation.error.response.data?.message.includes("PersonalSchedule with id")
-    ) {
-      return (
-        <BasicLayout>
-          <div className="pt-2">
-            <h1>Create New Course</h1>
-            <CourseForm submitAction={onSubmit} />
-            <p data-testid="PSCourseCreate-Error">
-              Error: Personal schedule not found. Please{" "}
-              <Link to="/personalschedules/create">
-                create a new personal schedule
-              </Link>{" "}
-              first.
-            </p>
-          </div>
-        </BasicLayout>
-      );
-    } else {
+    ) {} else {
       return (
         <BasicLayout>
killedBy: CoursesCreatePage tests 404
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:64:12
           </div>
         </BasicLayout>
       );
-    } else {
-      return (
-        <BasicLayout>
-          <div className="pt-2">
-            <h1>Create New Course</h1>
-            <CourseForm submitAction={onSubmit} />
-            <p data-testid="PSCourseCreate-Error">
-              Error: {mutation.error.response.data?.message}
-            </p>
-          </div>
-        </BasicLayout>
-      );
-    }
+    } else {}
   }
 
killedBy: CoursesCreatePage tests we display the correct error message
statusReason: Error: Unable to find an element by: [data-testid="PSCourseCreate-Error"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
