[Killed] StringLiteral
main/pages/Courses/PSCourseIndexPage.js:22:12
     {
       // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
       method: "GET",
-      url: "/api/courses/user/all",
+      url: "",
     },
     [],
killedBy: CoursesIndexPage tests renders two courses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Courses/PSCourseIndexPage.js:27:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button variant="primary" href="/courses/create" style={{}}>
-        Add New Course
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: CoursesIndexPage tests renders 'Add New Course' button
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/add new course/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav
