[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:22:30
     { method: "GET", url: "/api/personalschedules/all" },
     [],
   );
-  const createButton = () => {
-    return (
-      <Button variant="primary" href="/personalschedules/create" style={{}}>
-        Add New Personal Schedule
-      </Button>
-    );
-  };
+  const createButton = () => {};
   return (
     <BasicLayout>
killedBy: PersonalSchedulesIndexPage tests renders 'Add New Personal Schedule' button
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/add new personal schedule/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav
