[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:18:18
   const { data: systemInfo } = useSystemInfo();
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const endQtr = systemInfo?.endQtrYYYYQ && "20214";
   // Stryker enable OptionalChaining
   const quarters = quarterRange(startQtr, endQtr);
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:41:8
     1: "W",
     2: "S",
     3: "M",
-    4: "F",
+    4: "",
   };
 
killedBy: PersonalScheduleForm tests Form has initialPersonalSchedule content with Fall quarter
statusReason: Error: expect(element).toHaveValue(F22)

Expected the element to have value:
  F22
Received:
  22

<html>

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:67:32
           id="name"
           type="text"
           isInvalid={Boolean(errors.name)}
-          {...register("name", {
-            required: "Name is required.",
-            maxLength: {
-              value: 15,
-              message: "Max length 15 characters",
-            },
-          })}
+          {...register("name", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: PersonalScheduleForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:104:15
             type="text"
             {...register("quarter")}
             value={
-              quarterMap[initialPersonalSchedule.quarter.substring(4, 5)] +
-              initialPersonalSchedule.quarter.substring(2, 4)
+              quarterMap[initialPersonalSchedule.quarter.substring(4, 5)] - initialPersonalSchedule.quarter.substring(2, 4)
             }
             disabled
killedBy: PersonalScheduleForm tests Form has initialPersonalSchedule content with Fall quarter
statusReason: Error: expect(element).toHaveValue(F22)

Expected the element to have value:
  F22
Received:
  NaN

<html>

[Killed] MethodExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:104:26
             type="text"
             {...register("quarter")}
             value={
-              quarterMap[initialPersonalSchedule.quarter.substring(4, 5)] +
+              quarterMap[initialPersonalSchedule.quarter] +
               initialPersonalSchedule.quarter.substring(2, 4)
             }
killedBy: PersonalScheduleForm tests Form has initialPersonalSchedule content with Fall quarter
statusReason: Error: expect(element).toHaveValue(F22)

Expected the element to have value:
  F22
Received:
  undefined22

<html>

[Killed] MethodExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:105:15
             {...register("quarter")}
             value={
               quarterMap[initialPersonalSchedule.quarter.substring(4, 5)] +
-              initialPersonalSchedule.quarter.substring(2, 4)
+              initialPersonalSchedule.quarter
             }
             disabled
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(W22)

Expected the element to have value:
  W22
Received:
  W20221
