[Killed] EqualityOperator
main/components/Quarters/SingleQuarterDropdown.js:39:9
     localStorage.setItem(controlId, selectedQuarter);
     setQuarterState(selectedQuarter);
     setQuarter(selectedQuarter);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: SingleQuarterSelector tests when I select an object, the value changes
statusReason: TypeError: onChange is not a function
