[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:12:30
 import { Button } from "react-bootstrap";
 
 export default function PersonalSchedulesEditPage() {
-  const createButton = () => {
-    return (
-      <Button variant="primary" href="/personalschedules/list" style={{}}>
-        Back
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   let { id } = useParams();
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally renders 'Back' button
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/back/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:30:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/personalschedules?id=${id}"],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/personalschedules`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:55:31
     [],
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:55:54
     [],
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = (personalSchedule) => ({});
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:56:10
   );
 
   const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
+    url: "",
     method: "PUT",
     params: {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via put on "

Number of calls: 1

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:57:13
 
   const objectToAxiosParams = (personalSchedule) => ({
     url: "/api/personalschedules",
-    method: "PUT",
+    method: "",
     params: {
       id: personalSchedule.id,
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "PersonalSchedule Updated - id: 17 name: CS156"

Number of calls: 1

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:71:7
 
   const onSuccess = (personalSchedule) => {
     toast(
-      `PersonalSchedule Updated - id: ${personalSchedule.id} name: ${personalSchedule.name}`,
+      ``,
     );
     console.log(personalSchedule.quarter);
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:89:18
     mutation.mutate(data);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/personalschedules/list" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/personalschedules/list"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:98:10
       <div className="pt-2">
         <h1>Edit Personal Schedule</h1>
         {createButton()}
-        {personalSchedule && (
-          <PersonalScheduleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialPersonalSchedule={personalSchedule}
-          />
-        )}
+        {personalSchedule || <PersonalScheduleForm submitAction={onSubmit} buttonLabel={"Update"} initialPersonalSchedule={personalSchedule} />}
         <p className="py-5">
           <h1>Courses</h1>
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, user, description, quarter, name}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:98:10
       <div className="pt-2">
         <h1>Edit Personal Schedule</h1>
         {createButton()}
-        {personalSchedule && (
-          <PersonalScheduleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialPersonalSchedule={personalSchedule}
-          />
-        )}
+        {true}
         <p className="py-5">
           <h1>Courses</h1>
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
