[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:116:13
       ),
     },
     {
-      name: "Update Courses Database by quarter range",
+      name: "",
       form: (
         <UpdateCoursesByQuarterRangeJobForm
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter range. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:124:13
       ),
     },
     {
-      name: "Update Grade Info",
+      name: "",
       form: <JobComingSoon />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Grade Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
