[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:10:46
 import { Link } from "react-router-dom";
 
 export default function AddToScheduleModal({ section, onAdd }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [selectedSchedule, setSelectedSchedule] = useState("");
 
killedBy: AddToScheduleModal renders without crashing
statusReason: Error: useHref() may be used only in the context of a <Router> component.
