[Killed] BlockStatement
main/components/Sections/SectionsTable.js:25:63
   return values[0];
 }
 
-export function isLectureWithNoSections(enrollCode, sections) {
-  // Find the section with the given enrollCode
-  const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
-  );
-
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    }
-  }
-
-  return false;
-}
+export function isLectureWithNoSections(enrollCode, sections) {}
 
 export const objectToAxiosParams = (data) => {
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:31:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:37:35
     const sectionNumber = section.section.section;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    }
+    if (sectionNumber === "0100") {}
   }
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
main/components/Sections/SectionsTable.js:39:30
     // Check if the section number is '0100', indicating a lecture
     if (sectionNumber === "0100") {
       // Filter all sections with the same courseId
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
+      const courseSections = sections;
 
       // Check if there is only one section for the course

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:40:22
     if (sectionNumber === "0100") {
       // Filter all sections with the same courseId
       const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
+        (section) => false,
       );
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:191:57
       Header: "Enroll Code",
       accessor: "section.enrollCode",
       disableGroupBy: true,
-      Cell: ({ cell: { value }, row: { original } }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <span>{value}</span>
-              <AddToScheduleModal
-                section={original}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return value;
-        }
-        // Stryker restore all
-      },
+      Cell: ({ cell: { value }, row: { original } }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
