[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:29:19
     [],
   );
 
-  useEffect(() => {
-    if (schedules.length > 0) {
-      setSchedule(schedules[0].id);
-    }
-  }, [schedules, setSchedule]);
+  useEffect(() => {}, [schedules, setSchedule]);
 
   const handleScheduleOnChange = (event) => {
killedBy: PersonalScheduleSelector calls setSchedule with the first schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:30:9
   );
 
   useEffect(() => {
-    if (schedules.length > 0) {
+    if (schedules.length >= 0) {
       setSchedule(schedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:30:9
   );
 
   useEffect(() => {
-    if (schedules.length > 0) {
+    if (true) {
       setSchedule(schedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ArrayDeclaration
main/components/PersonalSchedules/PersonalScheduleSelector.js:33:6
     if (schedules.length > 0) {
       setSchedule(schedules[0].id);
     }
-  }, [schedules, setSchedule]);
+  }, []);
 
   const handleScheduleOnChange = (event) => {
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:53:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {schedules &&
-          schedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:53:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {schedules &&
-          schedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {false}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalScheduleSelector.js:54:25
         onChange={handleScheduleOnChange}
       >
         {schedules &&
-          schedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+          schedules.map(() => undefined)}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"
